Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Rename %1$@ to %2$@
fr: Renommer %1$@ en %2$@
ko: %1$@의 이름을 %2$@(으)로 변경
tr: %1$@ adını %2$@ olarak değiştir
vi: Đổi tên %1$@ thành %2$@
zh_hans: 将 %1$@ 重命名为 %2$@
zh_hant: 將 %1$@ 重新命名為 %2$@

source: Field type
fr: Type de champ

source: This database does not support ON DELETE %@.
fr: Cette base de données ne prend pas en charge ON DELETE %@.

source: Delete %lld Connections
fr: Supprimer %lld connexions
ko: 연결 %lld개 삭제
tr: %lld Bağlantıyı Sil
vi: Xóa %lld Kết nối
zh_hans: 删除 %lld 个连接
zh_hant: 刪除 %lld 個連線

source: This license was activated on a different Mac. Activate it here to use Pro features.
fr: Cette licence a été activée sur un Mac différent. Activez-la ici pour utiliser les fonctionnalités Pro.
ko: 이 라이선스는 다른 Mac에서 활성화되었습니다. 여기에서 활성화하면 Pro 기능을 사용할 수 있습니다.
tr: Bu lisans başka bir Mac'te etkinleştirildi. Pro özelliklerini kullanmak için burada etkinleştirin.
vi: Giấy phép này đã được kích hoạt trên một máy Mac khác. Kích hoạt tại đây để dùng các tính năng Pro.
zh_hans: 此许可证已在另一台 Mac 上激活。在此激活以使用 Pro 功能。
zh_hant: 此授權已在另一台 Mac 上啟用。在此啟用以使用 Pro 功能。

source: Account Identifier
fr: Identifiant du compte
ko: 계정 식별자
tr: Hesap tanımlayıcısı
vi: Mã định danh tài khoản
zh_hans: 账户标识符
zh_hant: 帳號識別碼

source: Same plan shape, different numbers
fr: Même forme de plan, différents numéros
ko: 플랜 구조는 같고 수치만 다름
tr: Aynı plan yapısı, farklı sayılar
vi: Cùng cấu trúc kế hoạch, khác số liệu
zh_hans: 计划结构相同，数值不同
zh_hant: 計劃結構相同，數值不同

source: Database Type
fr: Type de base de données
ko: 데이터베이스 유형
tr: Veritabanı Türü
vi: Loại Database
zh_hans: 数据库类型
zh_hant: 資料庫類型

source: The connection this query was recorded against no longer exists.
fr: La connexion contre laquelle cette requête a été enregistrée n'existe plus.
ko: 이 쿼리를 기록한 연결이 더 이상 존재하지 않습니다.
tr: Bu sorgunun kaydedildiği bağlantı artık yok.
vi: Kết nối mà truy vấn này được ghi lại không còn tồn tại.
zh_hans: 记录此查询时使用的连接已不存在。
zh_hant: 記錄此查詢時使用的連線已不存在。

source: The code expires in 15 minutes.
fr: Le code expire dans 15 minutes.
ko: 코드는 15분 후 만료됩니다.
tr: Kod 15 dakika içinde sona erer.
vi: Mã sẽ hết hạn sau 15 phút.
zh_hans: 代码将在 15 分钟后过期。
zh_hant: 驗證碼將在 15 分鐘後過期。

source: Search databases
fr: Rechercher dans les bases de données
ko: 데이터베이스 검색
tr: Veritabanlarında ara
vi: Tìm kiếm cơ sở dữ liệu
zh_hans: 搜索数据库
zh_hant: 搜尋資料庫

source: No AI provider is active, so this conversation is read-only.
fr: Aucun fournisseur d'IA n'est actif, donc cette conversation est en lecture seule.

source: Delete Theme
fr: Supprimer le thème
ko: 테마 삭제
tr: Temayı Sil
vi: Xoá chủ đề
zh_hans: 删除主题
zh_hant: 刪除主題

source: %d connected
fr: %d connectés
ko: %d개 연결됨
tr: %d bağlı
vi: %d đã kết nối
zh_hans: 已连接%d个
zh_hant: 已連線 %d 個

source: Invalid UUID: %@
fr: UUID invalide : %@
ko: 잘못된 UUID: %@
tr: Geçersiz UUID: %@
vi: UUID không hợp lệ: %@
zh_hans: 无效的 UUID：%@
zh_hant: UUID 無效：%@

source: Rebuild Table
fr: Reconstruire la table

source: Reset Sample Database?
fr: Réinitialiser la base de données d'échantillons
ko: 샘플 데이터베이스를 재설정하시겠습니까?
tr: Örnek Veritabanı Sıfırlansın mı?
vi: Đặt lại cơ sở dữ liệu mẫu?
zh_hans: 要重置示例数据库吗？
zh_hant: 要重設範例資料庫嗎？

source: is not NULL
fr: n'est pas NULL
ko: NULL이 아님
vi: không phải NULL
zh_hans: 不为 NULL
zh_hant: 不為 NULL

source: Exclude Every Table
fr: Exclure toutes les tables
ko: 모든 테이블 제외
tr: Her Tabloyu Hariç Tut
vi: Loại trừ mọi bảng
zh_hans: 排除所有表
zh_hant: 排除所有資料表

source: Method
fr: Méthode
ko: 메서드
tr: Yöntem
vi: Phương thức
zh_hans: 方法
zh_hant: 方法

source: Approval
fr: Approbation

source: Nothing to Show
fr: Rien à montrer
ko: 표시할 내용 없음
tr: Gösterilecek Bir Şey Yok
vi: Không có gì để hiển thị
zh_hans: 无内容可显示
zh_hant: 無內容可顯示

source: Every 30 seconds
fr: Chaque 30 secondes

source: Last used %@
fr: Dernière utilisation %@
ko: 마지막 사용 %@
tr: Son kullanım %@
vi: Dùng lần cuối %@
zh_hans: 上次使用 %@
zh_hant: 上次使用 %@

source: Select filter column
fr: Sélectionner la colonne de filtrage
ko: 필터 열 선택
tr: Filtre sütunu seç
vi: Chọn cột lọc
zh_hans: 选择筛选列
zh_hant: 選擇篩選欄位

source: Family
fr: Famille
ko: 서체
tr: Aile
vi: Họ phông
zh_hans: 字体族
zh_hant: 字型家族

source: 1 statement stays out of this run and %@ keeps what it has for it.
fr: 1 déclaration reste hors de cette course et %@ garde ce qu'elle a pour elle.
ko: 구문 1개는 이번 실행에서 제외되며, %@은(는) 해당 항목을 그대로 유지합니다.
tr: 1 ifade bu çalıştırmanın dışında kalır ve %@ bunun için mevcut hâlini korur.
vi: 1 câu lệnh nằm ngoài lần chạy này và %@ giữ nguyên những gì đang có cho nó.
zh_hans: 1 条语句不参与本次运行，%@ 中相关内容保持原样。
zh_hant: 1 條陳述式不參與本次執行，%@ 中相關內容維持原狀。

source: Functions
fr: Fonctions
ko: 함수
tr: İşlevler
vi: Hàm
zh_hans: 函数
zh_hant: 函式

source: Cannot save changes to '%@'.
fr: Impossible d'enregistrer les modifications à '%@'.

source: The table has no column named %@.
fr: La table n'a pas de colonne nommée %@.

source: Fonts
fr: Police de caractères
ko: 글꼴
tr: Yazı Tipleri
vi: Phông chữ
zh_hans: 字体
zh_hant: 字型

source: The code has been copied to your clipboard.
fr: Le code a été copié dans votre presse-papiers.
ko: 코드가 클립보드에 복사되었습니다.
tr: Kod panonuza kopyalandı.
vi: Mã đã được sao chép vào clipboard.
zh_hans: 代码已复制到剪贴板。
zh_hant: 驗證碼已複製到剪貼簿。

source: Driver status message, when the engine sent one
fr: Message de statut du conducteur, lorsque le moteur en a envoyé un.
ko: 엔진이 보낸 경우의 드라이버 상태 메시지
tr: Motor gönderdiyse sürücü durum mesajı
vi: Thông báo trạng thái của driver, khi engine có gửi
zh_hans: 引擎发送时返回的驱动状态消息
zh_hant: 引擎傳送時回傳的驅動程式狀態訊息

source: Duplicate Table Structure
fr: Structure de table de duplication
ko: 테이블 구조 복제
tr: Tablo Yapısını Çoğalt
vi: Nhân bản cấu trúc bảng
zh_hans: 复制表结构
zh_hant: 複製資料表結構

source: Create New Tag
fr: Créer une nouvelle balise
ko: 새 태그 생성
tr: Yeni Etiket Oluştur
vi: Tạo thẻ mới
zh_hans: 创建新标签
zh_hant: 建立新標籤

source: %@ seconds
fr: %@ secondes
ko: %@초
tr: %@ saniye
vi: %@ giây
zh_hans: %@ 秒
zh_hant: %@ 秒

source: Listens only on 127.0.0.1.
fr: Écoute uniquement sur 127.0.0.1.
ko: 127.0.0.1에서만 수신 대기합니다.
tr: Yalnızca 127.0.0.1 üzerinde dinler.
vi: Chỉ lắng nghe trên 127.0.0.1.
zh_hans: 仅监听 127.0.0.1。
zh_hant: 只監聽 127.0.0.1。

source: %1$@, entry %2$lld: %3$@
fr: %1$@, entrée %2$lld : %3$@

source: The plugin's executable file is missing.
fr: Le fichier exécutable du plugin est manquant.
ko: 플러그인의 실행 파일이 없습니다.
tr: Eklentinin çalıştırılabilir dosyası eksik.
vi: Thiếu tệp thực thi của plugin.
zh_hans: 缺少插件的可执行文件。
zh_hant: 缺少外掛的執行檔。

source: Drop all tables that depend on this table
fr: Supprimez toutes les tables qui dépendent de cette table.
ko: 이 테이블에 종속된 모든 테이블 삭제
tr: Bu tabloya bağımlı tüm tabloları bırak
vi: Xóa tất cả bảng phụ thuộc vào bảng này
zh_hans: 删除所有依赖此表的表
zh_hant: 刪除所有依賴此資料表的資料表

source: A connection cannot use SSH and Cloudflare tunnels at the same time.
fr: Une connexion ne peut pas utiliser les tunnels SSH et Cloudflare en même temps.
ko: 한 연결에서 SSH와 Cloudflare 터널을 동시에 사용할 수 없습니다.
tr: Bir bağlantı SSH ve Cloudflare tünellerini aynı anda kullanamaz.
vi: Kết nối không thể dùng SSH tunnel và Cloudflare tunnel cùng lúc.
zh_hans: 连接不能同时使用SSH隧道和Cloudflare隧道。
zh_hant: 連線無法同時使用 SSH 隧道和 Cloudflare 隧道。

source: Advanced object-relational SQL
fr: SQL relationnel avancé objet-objet
ko: 고급 객체 관계형 SQL
tr: Gelişmiş nesne-ilişkisel SQL
vi: SQL quan hệ-đối tượng nâng cao
zh_hans: 高级对象关系型SQL
zh_hant: 進階的物件關聯式 SQL

source: Next match
fr: Prochain match
ko: 다음 일치 항목
tr: Sonraki eşleşme
vi: Kết quả khớp tiếp theo
zh_hans: 下一个匹配
zh_hant: 下一個符合項目

source: Time to the first row is measured here, so it includes one network round trip.
fr: Le temps jusqu'à la première rangée est mesuré ici, donc il comprend un aller-retour sur le réseau.

source: Google Cloud serverless data warehouse
fr: Stockage de données sans serveur Google Cloud
ko: Google Cloud 서버리스 데이터 웨어하우스
tr: Google Cloud sunucusuz veri ambarı
vi: Kho dữ liệu serverless của Google Cloud
zh_hans: Google Cloud 无服务器数据仓库
zh_hant: Google Cloud 無伺服器資料倉儲

source: The transaction could not be committed: %@
fr: La transaction n'a pas pu être effectuée : %@
ko: 트랜잭션을 커밋할 수 없습니다: %@
tr: İşlem kaydedilemedi: %@
vi: Không thể commit giao dịch: %@
zh_hans: 事务无法提交：%@
zh_hant: 交易無法提交：%@

source: Hide Assistant
fr: Masquer l'assistant

source: %d rows hold NULL in a key column and were left out. Choose a key with no NULLs to compare them.
fr: %d lignes contiennent NULL dans une colonne clé et ont été omises. Choisissez une clé sans NULL pour les comparer.
ko: %d개 행은 키 열이 NULL이라 제외되었습니다. 비교하려면 NULL이 없는 키를 선택하십시오.
tr: %d satır anahtar sütununda NULL tutuyor ve dışarıda bırakıldı. Bunları karşılaştırmak için NULL içermeyen bir anahtar seçin.
vi: %d dòng có NULL ở cột khóa nên đã bị bỏ ra. Chọn khóa không có NULL để so sánh chúng.
zh_hans: %d 行的键列为 NULL，已被排除。请选择不含 NULL 的键来比较它们。
zh_hant: %d 列的鍵欄位為 NULL，已被排除。請選擇不含 NULL 的鍵來比較它們。

source: Drop %1$lld %2$@?
fr: Déposez %1$lld %2$@?
ko: %1$lld개의 %2$@을(를) 삭제하시겠습니까?
tr: %1$lld %2$@ silinsin mi?
vi: Xoá %1$lld %2$@?
zh_hans: 要删除 %1$lld 个%2$@吗？
zh_hant: 要刪除 %1$lld 個%2$@嗎？

source: That filter is incomplete.
fr: Ce filtre est incomplet.
ko: 해당 필터가 완전하지 않습니다.
tr: Bu filtre eksik.
vi: Bộ lọc đó chưa đầy đủ.
zh_hans: 该筛选条件不完整。
zh_hant: 該篩選條件不完整。

source: %@ cannot start with a dash or contain spaces
fr: %@ ne peut pas commencer par un tiret ou contenir des espaces.

source: Show Definition
fr: Définition de l'émission

source: Keyword
fr: Mot clé
ko: 키워드
tr: Anahtar Kelime
vi: Từ khoá
zh_hans: 关键字
zh_hant: 關鍵字

source: Open MQL Editor
fr: Ouvrir l'éditeur MQL
ko: MQL 편집기 열기
vi: Mở trình soạn MQL
zh_hans: 打开 MQL 编辑器
zh_hant: 開啟 MQL 編輯器

source: Tree
fr: Arbre
ko: 트리
tr: Ağaç
vi: Cây
zh_hans: 树形
zh_hant: 樹狀

source: favorite
fr: Favoris
ko: 즐겨찾기
tr: sık kullanılan
vi: yêu thích
zh_hans: 收藏
zh_hant: 我的最愛

source: This database only runs read queries, so the connection is always Read-Only.
fr: Cette base de données ne fonctionne que pour les requêtes de lecture, donc la connexion est toujours en lecture seule.

source: Generate the script first.
fr: Générer le script d'abord.
ko: 먼저 스크립트를 생성하십시오.
tr: Önce betiği oluşturun.
vi: Hãy tạo script trước.
zh_hans: 请先生成脚本。
zh_hant: 請先產生指令稿。

source: Summarize what was run against a connection over a period, from the recorded history
fr: Résumez ce qui a été exécuté contre une connexion sur une période, à partir de l'historique enregistré.
ko: 기록된 이력을 바탕으로 일정 기간 동안 연결에서 실행된 내용을 요약합니다
tr: Kaydedilen geçmişten yola çıkarak bir dönem boyunca bir bağlantıda nelerin çalıştırıldığını özetler
vi: Tóm tắt những gì đã chạy trên một kết nối trong một khoảng thời gian, dựa trên lịch sử đã ghi
zh_hans: 根据记录的历史，汇总某段时间内在某个连接上运行了什么
zh_hant: 根據記錄的歷程，彙總某段時間內在某個連線上執行了什麼

source: Export connections with encrypted credentials.
fr: Exporter les connexions avec des identifiants cryptés.
ko: 암호화된 자격 증명과 함께 연결을 내보냅니다.
tr: Bağlantıları şifrelenmiş kimlik bilgileriyle dışa aktar.
vi: Xuất kết nối với thông tin đăng nhập được mã hóa.
zh_hans: 导出连接并加密凭据。
zh_hant: 匯出連線並加密憑證。

source: Query execution failed
fr: L'exécution de la requête a éch
ko: 쿼리 실행 실패
tr: Sorgu çalıştırma başarısız
vi: Thực thi truy vấn thất bại
zh_hans: 查询执行失败
zh_hant: 查詢執行失敗

source: Precision:
fr: Précision :
ko: 정밀도:
vi: Độ chính xác:
zh_hans: 精度：
zh_hant: 精確度：

source: Most popular open-source SQL database
fr: La base de données SQL open source la plus populaire
ko: 가장 인기 있는 오픈 소스 SQL 데이터베이스
tr: En popüler açık kaynaklı SQL veritabanı
vi: Cơ sở dữ liệu SQL mã nguồn mở phổ biến nhất
zh_hans: 最流行的开源 SQL 数据库
zh_hant: 最熱門的開放原始碼 SQL 資料庫

source: This database has no ON UPDATE action on a foreign key.
fr: Cette base de données n'a pas d'action ON UPDATE sur une clé étrangère.

source: Run some queries and this tab will show which you run most, which run slowest, and which got slower.
fr: Exécutez quelques requêtes et cette onglet vous montrera lesquelles vous exécutez le plus, lesquelles le plus lentement et lesquelles sont devenues plus lentes.
ko: 몇 개의 쿼리를 실행하면 이 탭에서 가장 자주 실행한 쿼리, 가장 느린 쿼리, 성능이 저하된 쿼리를 확인할 수 있습니다.
tr: Birkaç sorgu çalıştırın; bu sekme en çok çalıştırdıklarınızı, en yavaş olanları ve yavaşlayanları gösterecek.
vi: Chạy vài truy vấn và tab này sẽ cho thấy truy vấn nào bạn chạy nhiều nhất, chạy chậm nhất và chậm đi.
zh_hans: 运行一些查询，这个标签页就会显示哪些查询你运行得最多、哪些最慢、哪些变慢了。
zh_hant: 執行一些查詢，這個分頁就會顯示哪些查詢你執行得最多、哪些最慢、哪些變慢了。

source: Remote File
fr: Fichier distant
ko: 원격 파일
tr: Uzak Dosya
vi: Tệp từ xa
zh_hans: 远程文件
zh_hant: 遠端檔案

source: Drop Database or Schema
fr: Supprimer la base de données ou le schéma
ko: 데이터베이스 또는 스키마 삭제
tr: Veritabanını veya Şemayı Sil
vi: Xoá cơ sở dữ liệu hoặc schema
zh_hans: 删除数据库或 Schema
zh_hant: 刪除資料庫或綱要

source: Owning table, for a column match
fr: Posséder une table, pour une correspondance de colonne
ko: 열이 일치할 때 소유 테이블
tr: Bir sütun eşleşmesi için sahip tablo
vi: Bảng sở hữu, khi khớp theo cột
zh_hans: 所属表，用于列匹配
zh_hant: 所屬資料表，用於欄位比對

source: Invalid regular expression
fr: Expression régulière invalide

source: A column left out of the comparison is still written on insert and update. A filter and a row limit read only the rows they select, on both sides.
fr: Une colonne omise dans la comparaison est toujours écrite sur insérer et mettre à jour. Un filtre et une limite de rang ne lisent que les rangs qu'ils sélectionnent, des deux côtés.

source: Connection it ran on
fr: La connexion sur laquelle il fonctionnait
ko: 실행된 연결
tr: Çalıştığı bağlantı
vi: Kết nối mà nó đã chạy trên đó
zh_hans: 它运行所在的连接
zh_hant: 它執行所在的連線

source: The file is empty.
fr: Le fichier est vide.

source: Replace…
fr: Remplacer...

source: Security Protocol
fr: Protocole de sécurité
ko: 보안 프로토콜
tr: Güvenlik Protokolü
vi: Giao thức bảo mật
zh_hans: 安全协议
zh_hant: 安全性協定

source: Latency: %lldms
fr: Latence : %lldms
ko: 지연 시간: %lldms
tr: Gecikme: %lldms
vi: Độ trễ: %lldms
zh_hans: 延迟: %lldms
zh_hant: 延遲:%lldms

source: Created as GitHub issue #%d
fr: Créé comme problème GitHub #%d
ko: GitHub 이슈 #%d(으)로 생성됨
tr: GitHub issue #%d olarak oluşturuldu
vi: Đã tạo thành GitHub issue #%d
zh_hans: 已创建为 GitHub issue #%d
zh_hant: 已建立為 GitHub issue #%d

source: Set Up AI Provider
fr: Configurer le fournisseur d'IA
ko: AI 제공업체 설정
vi: Thiết lập nhà cung cấp AI
zh_hans: 设置 AI 提供商
zh_hant: 設定 AI 供應商

source: Restore without applying
fr: Restaurer sans appliquer

source: Stopped
fr: Arrêté
ko: 중지됨
tr: Durduruldu
vi: Đã dừng
zh_hans: 已停止
zh_hant: 已停止

source: Add a connection first.
fr: Ajoutez d'abord une connexion.

source: Sponsor on GitHub
fr: Parrainage sur GitHub
ko: GitHub에서 후원
tr: GitHub'da Sponsor Ol
vi: Tài trợ trên GitHub
zh_hans: 在 GitHub 上赞助
zh_hant: 在 GitHub 上贊助

source: Primary Key
fr: Clé primaire
ko: 기본 키
tr: Birincil Anahtar
vi: Khoá chính
zh_hans: 主键
zh_hant: 主鍵

source: "%@" is not a library.
fr: «%@» n’est pas une bibliothèque.

source: 8 spaces
fr: 8 espaces
ko: 공백 8개
tr: 8 boşluk
vi: 8 dấu cách
zh_hans: 8 个空格
zh_hant: 8 個空格

source: No available local port for the Cloudflare tunnel.
fr: Pas de port local disponible pour le tunnel Cloudflare.
ko: Cloudflare 터널에 사용할 수 있는 로컬 포트가 없습니다.
tr: Cloudflare tüneli için kullanılabilir yerel port yok.
vi: Không có cổng cục bộ khả dụng cho tunnel Cloudflare.
zh_hans: 没有可用于 Cloudflare 隧道的本地端口。
zh_hant: 沒有可用於 Cloudflare 隧道的本機連接埠。

source: Active Merges
fr: Fusions actives
ko: 활성 병합
tr: Aktif Birleştirmeler
vi: Hợp nhất đang chạy
zh_hans: 活跃合并
zh_hant: 進行中的合併

source: AI Rules
fr: Règles de l'IA
ko: AI 규칙
tr: Yapay zeka kuralları
vi: Quy tắc AI
zh_hans: AI规则
zh_hant: AI 規則

source: 1 connection found
fr: 1 connexion trouvée
ko: 1개 연결 발견
tr: 1 bağlantı bulundu
vi: Tìm thấy 1 kết nối
zh_hans: 找到 1 个连接
zh_hant: 找到 1 個連線

source: Groups & Tags:
fr: Groupes et balises :
ko: 그룹 및 태그:
tr: Gruplar ve Etiketler:
vi: Nhóm & thẻ:
zh_hans: 分组与标签：
zh_hant: 群組與標籤：

# %d-%d of ? rows
source: %1$d-%2$d of ? rows
fr: %1$d-%2$d de ? lignes
ko: %1$d-%2$d / ?행
tr: %1$d-%2$d / ? satır
vi: %1$d-%2$d trên ? hàng
zh_hans: 第%1$d-%2$d行，共?行
zh_hant: %1$d-%2$d / ? 列

source: Local only
fr: Seulement local
ko: 로컬 전용
tr: Sadece yerel
vi: Chỉ cục bộ
zh_hans: 仅本地
zh_hant: 僅限本機

source: Authentication failed: %@
fr: Erreur d'authentification : %@
ko: 인증 실패: %@
tr: Kimlik doğrulama başarısız: %@
vi: Xác thực thất bại: %@
zh_hans: 身份验证失败：%@
zh_hant: 身分驗證失敗：%@

source: Table Browsing
fr: Parcours de table
ko: 테이블 탐색
tr: Tablo Gezinme
vi: Duyệt bảng
zh_hans: 表浏览
zh_hant: 資料表瀏覽

source: Reassign owned objects
fr: Réattribuer des objets détenus
ko: 소유 객체 재할당
tr: Sahip olunan nesneleri devret
vi: Chuyển quyền sở hữu các đối tượng
zh_hans: 转移拥有的对象
zh_hant: 轉移擁有的物件

source: Trigger
fr: Détente
ko: 트리거
tr: Tetikleyici
zh_hans: 触发器
zh_hant: 觸發器

source: Execute Query
fr: Exécuter la requête
ko: 쿼리 실행
tr: Sorguyu Çalıştır
vi: Thực thi truy vấn
zh_hans: 执行查询
zh_hant: 執行查詢

source: Unterminated comment
fr: Commentaire non terminé
ko: 종료되지 않은 주석
tr: Sonlandırılmamış yorum
vi: Ghi chú chưa đóng
zh_hans: 注释未闭合
zh_hant: 註解未結束

source: Plans are not saved for queries that carry parameters, because a database can print the values into its plan output.
fr: Les plans ne sont pas enregistrés pour les requêtes qui comportent des paramètres, car une base de données peut afficher les valeurs dans son résultat de planification.
ko: 데이터베이스가 플랜 출력에 값을 그대로 표시할 수 있으므로, 매개변수를 사용하는 쿼리의 플랜은 저장하지 않습니다.
tr: Bir veritabanı değerleri plan çıktısına yazdırabildiği için, parametre taşıyan sorguların planları kaydedilmez.
vi: Kế hoạch không được lưu cho truy vấn có tham số, vì cơ sở dữ liệu có thể in giá trị vào kết quả kế hoạch.
zh_hans: 数据库可能把参数值打印到计划输出中，因此带参数的查询不会保存计划。
zh_hant: 資料庫可能把參數值列印到計劃輸出中，因此帶參數的查詢不會儲存計劃。

source: Timestamp digits compared
fr: Comparaison des chiffres de l'horodatage
ko: 비교할 타임스탬프 자릿수
tr: Karşılaştırılan zaman damgası basamakları
vi: Số chữ số timestamp được so sánh
zh_hans: 参与比较的时间戳位数
zh_hant: 參與比較的時間戳記位數

source: Maximum rows to return. Defaults to the server's configured default row limit and is capped at its maximum row limit.
fr: Nombre maximum de lignes à retourner. Par défaut, il s'agit de la limite de lignes par défaut configurée par le serveur et est limitée à sa limite de lignes maximale.
ko: 반환할 최대 행 수입니다. 기본값은 서버에 설정된 기본 행 제한이며 최대 행 제한을 초과할 수 없습니다.
tr: Döndürülecek en fazla satır sayısı. Varsayılan olarak sunucunun ayarlı varsayılan satır limitidir ve maksimum satır limitiyle sınırlanır.
vi: Số dòng tối đa được trả về. Mặc định là giới hạn dòng mặc định của máy chủ và bị chặn ở giới hạn dòng tối đa.
zh_hans: 返回的最大行数。默认使用服务器配置的默认行数限制，并受其最大行数限制约束。
zh_hant: 回傳的最大列數。預設使用伺服器設定的預設列數上限，並受其最大列數上限限制。

source: Latest
fr: Dernier

source: Merge
fr: Fusionner
ko: 병합
tr: Birleştir
vi: Gộp
zh_hans: 合并
zh_hant: 合併

source: the SOCKS proxy
fr: Le proxy SOCKS
ko: SOCKS 프록시
tr: SOCKS proxy
vi: SOCKS proxy
zh_hans: SOCKS 代理
zh_hant: SOCKS 代理

source: Queries recently run against this connection, newest first
fr: Les requêtes effectuées récemment contre cette connexion, de la plus récente à la plus ancienne.
ko: 이 연결에서 최근에 실행한 쿼리이며 최신순입니다
tr: Bu bağlantıda son çalıştırılan sorgular, en yeniden başlayarak
vi: Các truy vấn chạy gần đây trên kết nối này, mới nhất trước
zh_hans: 此连接上最近运行的查询，最新的在前
zh_hant: 此連線上最近執行的查詢，最新的在前

source: SSH tunnel creation failed: %@
fr: Création du tunnel SSH échouée : %@
ko: SSH 터널 생성 실패: %@
tr: SSH tüneli oluşturulamadı: %@
vi: Tạo đường hầm SSH thất bại: %@
zh_hans: 创建 SSH 隧道失败：%@
zh_hant: 建立 SSH 隧道失敗：%@

source: Key to send in 'options'
fr: Clé pour envoyer des "options"

source: Open a table tab in TablePro for the given connection.
fr: Ouvrez une onglet de table dans TablePro pour la connexion donnée.
ko: 지정된 연결의 테이블 탭을 TablePro에서 엽니다.
tr: Verilen bağlantı için TablePro'da bir tablo sekmesi açar.
vi: Mở một tab bảng trong TablePro cho kết nối đã cho.
zh_hans: 在 TablePro 中为指定连接打开一个表标签页。
zh_hant: 在 TablePro 中為指定的連線開啟資料表分頁。

source: Create Table cannot add an index on this database.
fr: Créer la table ne peut pas ajouter d'index sur cette base de données.

source: License
fr: Obtenir un permis pour
ko: 라이선스
tr: Lisans
vi: Giấy phép
zh_hans: 许可证
zh_hant: 授權

source: Raw SQL cannot be empty
fr: SQL brut ne peut pas être vide.
ko: 원시 SQL은 비워 둘 수 없습니다
tr: Ham SQL boş olamaz
vi: SQL thô không được để trống
zh_hans: 原始 SQL 不能为空
zh_hant: 原始 SQL 不可為空

source: Click "Edit Config" to open claude_desktop_config.json
fr: Cliquez sur "Modifier la configuration" pour ouvrir claude_desktop_config.json.
ko: "Edit Config"를 클릭하여 claude_desktop_config.json을 여십시오
tr: claude_desktop_config.json dosyasını açmak için "Edit Config" tıklayın
vi: Nhấn "Edit Config" để mở claude_desktop_config.json
zh_hans: 点击 "Edit Config" 打开 claude_desktop_config.json
zh_hant: 點按「Edit Config」以開啟 claude_desktop_config.json

source: "%@" will be permanently deleted.
fr: «%@» sera supprimé définitivement.
ko: "%@" 항목이 영구적으로 삭제됩니다.
tr: "%@" kalıcı olarak silinecek.
vi: "%@" sẽ bị xoá vĩnh viễn.
zh_hans: "%@" 将被永久删除。
zh_hant: 「%@」將會永久刪除。

source: Edit %1$@ "%2$@"…
fr: Modifier %1$@ "%2$@"...

source: This document no longer exists. It was deleted after the grid loaded.
fr: Ce document n'existe plus. Il a été supprimé après le chargement de la grille.

source: Blue
fr: Bleu
ko: 파란색
tr: Mavi
vi: Xanh dương
zh_hans: 蓝色
zh_hant: 藍色

source: Fetch all rows
fr: Récupérer toutes les lignes
ko: 모든 행 가져오기
tr: Tüm satırları getir
vi: Tải tất cả các dòng
zh_hans: 获取全部行
zh_hant: 取得全部列

source: greater-than sign
fr: Signe de plus grand que
ko: 보다 큼 기호
tr: büyüktür işareti
vi: dấu lớn hơn
zh_hans: 大于号
zh_hant: 大於號

source: Value as supplied
fr: Valeur telle qu'indiquée
ko: 입력한 그대로의 값
tr: Verildiği haliyle değer
vi: Giá trị đúng như được cung cấp
zh_hans: 按提供时的原样值
zh_hant: 按提供時的原樣值

source: Estimated Total Cost
fr: Coût total estimé
ko: 예상 총 비용
tr: Tahmini Toplam Maliyet
vi: Tổng chi phí ước tính
zh_hans: 估算总成本
zh_hant: 估算總成本

source: Drop View
fr: Vue de chute
ko: 뷰 삭제
tr: Görünümü Bırak
vi: Xóa view
zh_hans: 删除视图
zh_hant: 刪除檢視表

source: Quote if needed
fr: Fournir un devis si nécessaire
ko: 필요한 경우 따옴표 사용
vi: Đặt trong ngoặc kép nếu cần
zh_hans: 按需加引号
zh_hant: 必要時加引號

source: Color
fr: Couleur
ko: 색상
tr: Renk
vi: Màu sắc
zh_hans: 颜色
zh_hant: 顏色

source: Couldn't Restore Version
fr: Impossible de restaurer la version

source: Last 24 hours
fr: Dernières 24 heures
ko: 최근 24시간
tr: Son 24 saat
vi: 24 giờ qua
zh_hans: 过去 24 小时
zh_hant: 過去 24 小時

source: Control Background
fr: Contrôle de l'arrière-plan
ko: 컨트롤 배경
tr: Kontrol Arka Planı
vi: Nền điều khiển
zh_hans: 控件背景
zh_hant: 控制項背景

source: Searching…
fr: Recherche en cours...

source: seconds
fr: Secondes
ko: 초
tr: saniye
vi: giây
zh_hans: 秒
zh_hant: 秒

source: left parenthesis
fr: Parenthèse gauche
ko: 여는 괄호
tr: sol parantez
vi: dấu ngoặc đơn mở
zh_hans: 左括号
zh_hant: 左括號

source: Part Mutations
fr: Mutations partielles
ko: 파트 뮤테이션
tr: Parça Mutasyonları
vi: Thay đổi phần
zh_hans: 分区变更
zh_hant: 分割區異動

source: A superuser bypasses all permission checks.
fr: Un superutilisateur contourne toutes les vérifications de permissions.
ko: 슈퍼유저는 모든 권한 검사를 우회합니다.
tr: Superuser tüm izin denetimlerini atlar.
vi: Superuser bỏ qua mọi kiểm tra quyền.
zh_hans: 超级用户会跳过所有权限检查。
zh_hant: 超級使用者會略過所有權限檢查。

source: Could not write the Google Cloud service account key to a temporary file.
fr: Impossible d'écrire la clé du compte de service Google Cloud sur un fichier temporaire.
ko: Google Cloud 서비스 계정 키를 임시 파일에 쓸 수 없습니다.
tr: Google Cloud servis hesabı anahtarı geçici bir dosyaya yazılamadı.
vi: Không thể ghi khóa tài khoản dịch vụ Google Cloud vào tệp tạm.
zh_hans: 无法将 Google Cloud 服务账号密钥写入临时文件。
zh_hant: 無法將 Google Cloud 服務帳號金鑰寫入暫存檔案。

source: The dump is imported into this database, and the change cannot be undone. The import needs an empty database and stops if this one already holds objects.
fr: Le déversement est importé dans cette base de données, et le changement ne peut pas être annulé. L'importation nécessite une base de données vide et s'arrête si celle-ci contient déjà des objets.
